//大炮打蚊子
#include <stdio.h>
#include <stdlib.h>
int main()
{
    int m,n;
    int i,j;
    char a[21];
    double b[22][22];
    /*我在定义是b是标记数组，且比最大数组多出两行两列，
    避免下面炮弹落在边缘行列时有数组越界现象*/
    memset(b,0,sizeof(b));
    //先初始化为“0”，即假设一只蚊子也没有；
    scanf("%d%d",&m,&n);
    for(i=0; i<m; i++)
    {
        scanf("%s",a);
        //因为每一行都是没有空格隔开的一串字符，所以每一行可以看成一个字符串；
        for(j=0; j<n; j++)
        {
            if(a[j]=='#')
            //在这个字符串中如果有蚊子，就在相应位置标记成“2”；
                b[i+1][j+1] = 2;
        }
    }
    int k,a1,a2;
    scanf("%d",&k);
    while(k--)
    {
        int count=0;
        scanf("%d%d",&a1,&a2);
        //输入坐标，因为我在定义b数组时多出两行两列，所以下面a1，a2都多出“1”；
        if(b[a1+1][a2+1]>0)
        /*这是炮弹正中的格子，多以特判一下，
        如果这个格子里有活着的蚊子（格子中可能为“1”或“2”），直接计数变量加“1”；*/
        {
            count++;
            b[a1+1][a2+1]=0;
            //计数后，这个格子里的数据清零，即这个格子里没有蚊子了，下面同样；
        }

        if(b[a1][a2+1]>0)
        {
            b[a1][a2+1]=b[a1][a2+1]-1;
            /*因为b数组多出两行两列，即使炮弹落在第“0”行，“0”行上面的数据全都为“0”，
            所以不需要判断是否是边缘行列*/
            if( b[a1][a2+1]==0)
            {
                count++;
                b[a1][a2+1]=0;
            }

        }

        if(b[a1+1][a2]>0)
        {
            b[a1+1][a2]=b[a1+1][a2]-1;
            if(b[a1+1][a2]==0)
            {
                count++;
                b[a1+1][a2]=0;
            }

        }

        if(b[a1+1][a2+2]>0)
        {
            b[a1+1][a2+2]=b[a1+1][a2+2]-1;
            if(b[a1+1][a2+2]==0)
            {
                count++;
                b[a1+1][a2+2]=0;
            }

        }

        if(b[a1+2][a2+1]>0)
        {
            b[a1+2][a2+1]=b[a1+2][a2+1]-1;
            if( b[a1+2][a2+1]==0)
            {
                count++;
               b[a1+2][a2+1] = 0;
            }
        }
        printf("%d\n",count);


    }

    return 0;
}
 
