#include<stdio.h>
#include<stdlib.h>
void mainmenu();
int main()
{
	void mainmenu();
	return 0;
}
void mainmenu()
{
	int num;
	printf(" \n\n                    \n\n");
	printf("                          ******************************************************\n\n");
	printf("                          *                  西邮网购管理系统                 *\n \n");
	printf("                          ******************************************************\n\n");
	printf("                       ************************系统功能菜单************************       \n");
	printf("                            ----------------------   ----------------------   \n");
	printf("                             *********************************************     \n");
	printf("\n\n                                                                                       \n");
	printf("                                *   0.系统帮助及说明 * *    1.注册账号   *     \n");
	printf("                             *********************************************     \n");
	printf("                                *   2.登陆账号       * *   3.退出系统   * \n");
	printf("\n\n                                                                                         \n");
	printf("                         **********************************************************                            \n");
	printf("                             ----------------------   ----------------------                           \n");
	printf("                                               请选择菜单编号:");
	scanf("%d", &num);
}


